# while loop
# Basic knowledge.........
# সর্বপ্রথম একটি variable তৈরি করতে হবে। সেটার নিজস্ব মান থাকবে নয় তো ইউজার ইনপুট নিবে। 
# তারপর কন্ডিশন দিতে হবে। যদি কন্ডিশন অনুযায়ি সত্য হয় তবে সেটি পরবর্তি লাইনে চলে যাবে  
# সত্য প্রমানিত হওয়ার পর আমরা সেটা প্রিন্ট করব। 
# তারপর কাজ অনুযায়ি ভেরিয়েবলকে ফর্মুলায় প্রয়োগ করব। 
# ফর্মুলা থেকে প্রাপ্ত মান যদি কন্ডিশন অনুযায়ি সত্য হয় তবে সে মানকে প্রিন্ট করবে। 
# যখন কন্ডিশন অনুযায়ি মান চূড়ান্ত মানে পৌছে যাবে তখন লুপ সম্পন্ন হবে। 
# লুপ সম্পন্ন হওয়ার পর অন্য ব্লকের কাজ শুরু হবে। 


import time
# Advanced এর জন্য time ইমপোর্ট করা হলো। 

x = 0
while x < 5 :
    print (x)
    x = x + 1
    
    
# Now we go to advanced :)   

y = 0 
while y >= -1 :
    print ("-----------> " + str(y))
    time.sleep (.005)
    y = y + 1
    
    
# প্রথম লুপ অল্পতেই শেষ হয়ে যাবে। 
# তবে ২য় লোপ শেষ হবে না। কারন সেটা ইনফিনিটি পর্যন্ত চলতে থাকবে । 
